{
  "home": "Accueil",
  "about": "À propos",
  "projects": "Projets",
  "contact": "Contact",
  "resume": "CV",
  "btnresume": "Curriculum Vitæ",

  "homeMainTextBeg": "Salut, je suis ",
  "homeMainTextMid": "futur ingénieur",
  "homeMainTextEnd": " en informatique, en double diplôme entre la France et le Canada. Actuellement, je travaille avec",

  "aboutTitle0": "Quelques mots sur moi",
  "aboutTitle1": "À propos",
  "aboutText0": "Enchanté ! Je m’appelle Julien et je suis futur ingénieur en informatique, actuellement en double diplôme entre la France et le Canada.",
  "aboutText1": "Je me spécialise en cybersécurité. Mes études et projets m’ont permis d’explorer différents aspects du domaine tels que la sécurité des systèmes, la protection des données, l’analyse forensique, la gestion des incidents et l’Internet des objets. Curieux et motivé, j’aime approfondir mes connaissances et les appliquer dans des contextes pratiques.",
  "aboutText2": "Depuis l’année universitaire 2025-2026, j’étudie à l’Université du Québec à Chicoutimi (UQAC) dans le cadre d’un double diplôme en cybersécurité. Je suis actuellement à la recherche d’un stage à partir de juillet 2026, afin de mettre en pratique mes compétences en sécurité informatique et de contribuer activement à des projets innovants.",

  "projectTitle0": "Ce que j'ai codé",
  "projectTitle1": "Projets",
  "project0": "Création d'un site web portfolio personnel destiné à présenter mes compétences et projets réalisés.",
  "project1": "Un site web comportant une plateforme de e-commerce pour la vente de nourriture, avec des capacités d'authentification pour les utilisateurs.",
  "project2": "Un site web calqué sur IMDB, se concentrant sur les bases de données et informations de films.",
  "project3": "Automate cellulaire en 1D en Java et simulation d'incendie de forêt avec une interface graphique.",
  "project4": "Implémentation d'Interface Graphique : Maîtriser la Programmation Orientée Objet à travers le Développement de Jeu.",
  "project5": "Apprentissage de la modularité : Maîtriser la modularité d'un projet en utilisant le pattern Observer.",
  "project6": "Résolution du problème du sac à dos en Python avec des algorithmes de métaheuristiques pour optimiser la sélection des objets.",
  "projecttitle0": "Portfolio",
  "projecttitle1": "La Boutique française",
  "projecttitle2": "Projet tutoré",
  "projecttitle3": "Automate cellulaire",
  "projecttitle4": "Puissance 4",
  "projecttitle5": "Sokoban",
  "projecttitle6": "Métaheuristiques",

  "contactTitle0": "Écrivez-moi?",
  "contactTitle1": "Entrons en contact",
  "contactText": "Si vous êtes à la recherche d'un stagiaire ou si vous avez entendu parler d'une opportunité qui correspond à ce que je recherche, n'hésitez pas à me le faire savoir. Que vous ayez une question ou que vous souhaitiez simplement me dire « Bonjour », ma boîte de réception est toujours ouverte.  Je vous répondrai dès que possible. ",
  "formName": "Votre nom",
  "formEmail": "Votre email",
  "formMessage": "Votre message",
  "formSubmit": "Envoyer",
  "formSending": "Envoi en cours...",
  "formSent": "Message envoyé !",
  "formError": "Une erreur est survenue. Veuillez réessayer.",
  "formNewMessage": "Envoyer un autre message",

  "footer0": "Réalisé en mangeant des ",
  "footer1": "à Lyon",

  "buttonBack": "Retour",
  "titleleft0": "Langages",
  "titleleft1": "Technologies",
  "titleleft2": "Contributeurs",
  "titleright0": "Projet Portfolio",
  "titleright1": "Son objectif",
  "textright0": "Mon portfolio, conçu avec React.js et SCSS, est le témoignage de mon parcours continu dans la maîtrise de nouvelles technologies. Il présente une sélection de mes projets de manière interactive et esthétiquement agréable, démontrant non seulement mes compétences actuelles mais aussi mon engagement à apprendre et à adopter des pratiques de développement web à la pointe. Cette plateforme est à la fois une vitrine de mon travail et une indication de ma croissance continue dans le domaine technologique.",
  "textright1": "Mon projet est un site web portfolio complet conçu pour présenter mon travail, mes compétences et mon parcours professionnel. Il comporte une présentation détaillée de mes projets, une section « À propos » qui offre un aperçu de mon voyage personnel et professionnel, et un CV téléchargeable pour un examen plus approfondi de mes références. Les fonctionnalités clés incluent un mode nuit pour une visualisation confortable, une traduction bilingue en français et en anglais pour s'adresser à un public plus large, et une section de contact équipée d'un lien mailto pour une communication facile. Le site web est entièrement responsive, garantissant une expérience fluide sur divers appareils et tailles d'écran.",

  "titlerightB0": "Le projet La Boutique française",
  "textrightB0": "Mon projet est une incursion dans le monde de la vente en ligne, se concentrant spécifiquement sur une boutique en ligne de produits alimentaires où les utilisateurs peuvent parcourir et passer des commandes. Développée avec un accent sur les fonctionnalités réelles d'un site d'e-commerce, cette plateforme est construite en utilisant React.js et SCSS. Elle démontre non seulement ma capacité à créer une expérience d'achat conviviale, mais aussi mon engagement continu à apprendre et à appliquer de nouvelles technologies de développement web. À travers ce projet, j'ai acquis une expérience pratique dans l'intégration des fonctionnalités essentielles d'e-commerce, avançant dans mon parcours dans le domaine technologique tout en visant à rendre l'achat de nourriture en ligne aussi intuitif et efficace que possible.",
  "textrightB1": "Mon projet introduit une plateforme d'e-commerce innovante conçue pour l'achat de nourriture, qui améliore l'expérience utilisateur en permettant la création de comptes pour un shopping personnalisé. Les utilisateurs peuvent se connecter pour ajouter des produits à leur panier, procéder au paiement, et recevoir une facture générée pour leurs commandes. La plateforme accueille également les utilisateurs invités, leur permettant de passer des commandes sans compte, assurant flexibilité et commodité pour tous les utilisateurs. De plus, une fonctionnalité exclusive de connexion administrateur est intégrée, non pas pour passer des commandes, mais pour accéder à un tableau de bord spécialisé qui affiche toutes les commandes passées. Ici, les administrateurs ont la capacité de confirmer les commandes, rationalisant le processus de gestion. Ce projet ne montre pas seulement ma capacité à développer des fonctionnalités web complexes, mais souligne également mon engagement à apprendre et à mettre en œuvre des pratiques avancées de développement web, offrant un aperçu de mon expertise croissante dans la création de solutions en ligne complètes et centrées sur l'utilisateur.",

  "titlerightP0": "Le projet tutoré",
  "textrightP0": "Mon projet inspiré par IMDB, développé en utilisant React.js et une base de données de films complète, démontre mon parcours d'apprentissage et d'application des techniques de développement web dynamique. Il fournit une interface réactive et conviviale pour explorer une vaste bibliothèque de films, mettant en avant mes compétences croissantes et mon enthousiasme pour la technologie web et le secteur du divertissement. Cette entreprise reflète mon engagement continu à maîtriser de nouvelles technologies dans le domaine.",
  "textrightP1": "Mon projet est une plateforme avancée de base de données de films, similaire à IMDB, enrichie de fonctionnalités telles que la fonctionnalité de recherche, l'auto-complétion et des détails complets sur les films. Il permet aux utilisateurs de rechercher des films sans effort, offrant des suggestions en temps réel grâce à l'auto-complétion liée à la base de données. Lors de la sélection, il fournit un aperçu détaillé, incluant des résumés, des bandes-annonces et des informations supplémentaires liées aux films. De plus, il suggère des films connexes en fonction de votre recherche, améliorant le processus de découverte. Cet outil combine mes connaissances croissantes en développement web avec mon intérêt pour l'industrie du divertissement, démontrant ma capacité à intégrer des fonctionnalités complexes pour une expérience utilisateur engageante. Le projet est entièrement réactif, rendant l'exploration de films accessible sur n'importe quel appareil.",

  "titlerightA0": "Projet Automates",
  "textrightA0": "Pour améliorer mes compétences en Java et ma compréhension des interfaces graphiques, j'ai participé à un projet collaboratif qui impliquait le développement d'une simulation d'incendie de forêt et d'un automate cellulaire 1D. Ce projet nous a permis d'explorer des paramètres variables dans la simulation d'incendies de forêt et de personnaliser les règles pour l'automate cellulaire, offrant une approche pratique pour apprendre les capacités de l'interface graphique de Java et l'implémentation d'algorithmes. Ce fut une expérience précieuse dans l'application de Java pour créer des simulations significatives et interactives, démontrant notre capacité collective à relever des défis de programmation complexes.",
  "textrightA1": "Dans notre projet, nous avons développé un menu offrant le choix entre deux simulations : un automate cellulaire 1D où les utilisateurs peuvent sélectionner la règle et la liste initiale pour générer l'automate correspondant, et une simulation d'incendie de forêt. Pour la simulation d'incendie de forêt, une fenêtre de configuration initiale permet aux utilisateurs de configurer tous les paramètres, tels que la direction du vent et le nombre de feux initiaux. Ce projet a été conçu pour approfondir notre compréhension de Java et de ses interfaces graphiques, fournissant une application pratique de ces concepts à travers des simulations interactives qui défient et améliorent nos compétences en programmation.",

  "titlerightC0": "Projet Puissance 4",
  "textrightC0": "Pour améliorer ma compréhension des interfaces graphiques utilisateur en Java, j'ai développé un jeu de Puissance Quatre, guidé par la documentation spécialisée fournie par mon professeur. Ce projet m'a permis de peaufiner mes compétences dans la création d'interfaces interactives, démontrant mon engagement à apprendre et à maîtriser les capacités de l'interface graphique de Java. À travers cette entreprise, j'ai démontré mon engagement à faire avancer mes compétences techniques et à explorer de nouveaux domaines du développement logiciel.",
  "textrightC1": "Dans ma quête pour maîtriser les interfaces graphiques utilisateur, j'ai développé un menu polyvalent dans un projet d'interface graphique, offrant aux utilisateurs le choix entre les modes de jeu Joueur contre Joueur et Joueur contre Ordinateur. Ce menu interactif facilite non seulement une navigation fluide entre différentes options de jeu, mais permet également aux utilisateurs d'ajuster le niveau de difficulté, de revenir au menu principal et d'explorer divers réglages, assurant une expérience de jeu personnalisée. Ce projet souligne ma capacité à créer des interfaces flexibles et conviviales, reflétant mon engagement à améliorer mes compétences en programmation et à fournir des expériences digitales engageantes.",

  "titlerightS0": "Projet Sokoban",
  "textrightS0": "Pour approfondir ma compréhension de la modularité en Java, j'ai développé un jeu de Sokoban, guidé par les conseils de mon professeur. Ce projet, réalisé à Polytech Lyon, m'a permis de peaufiner mes compétences dans la création de logiciels modulaires, démontrant mon engagement à apprendre et à maîtriser les bonnes pratiques de développement logiciel. À travers ce projet, j'ai illustré mon engagement à améliorer mes compétences techniques et à explorer de nouveaux domaines du développement logiciel.",
  "textrightS1": "L'objectif principal était de structurer le code de manière modulaire, permettant une maintenance facile et des améliorations futures. Le jeu offre une interface graphique intuitive où les joueurs peuvent naviguer à travers différents niveaux et réinitialiser des parties. Ce projet démontre ma capacité à concevoir des logiciels robustes et modulaires, tout en renforçant mes compétences en ingénierie logicielle et en programmation orientée objet.",

  "titlerightM0": "Projet d'optimisation du problème du sac à dos",
  "textrightM0": "Dans le cadre de mon apprentissage des techniques d'optimisation, j'ai réalisé un projet en Python dédié à la résolution du problème du sac à dos. L'objectif était de développer et comparer plusieurs algorithmes de métaheuristiques afin de trouver des solutions efficaces pour ce problème combinatoire classique. Pour cela, j'ai implémenté des méthodes telles que la recherche tabou, les algorithmes génétiques et le recuit simulé. Ce projet m'a permis d'explorer en profondeur le fonctionnement et les performances de ces approches sur des jeux de données variés, tout en renforçant mes compétences en algorithmique et en manipulation de structures de données avec Python.",
  "textrightM1": "Ce projet, réalisé dans le cadre d'un cours d'optimisation discrète, avait pour but de comparer différentes métaheuristiques appliquées au problème du sac à dos. L'objectif était d'analyser plusieurs méthodes en mesurant leurs temps d'exécution, la qualité des solutions obtenues et l'influence des paramètres. Les résultats ont été organisés sous forme de graphiques et de tableaux afin d'en évaluer l'efficacité et de déterminer les approches les plus adaptées selon les cas.",

  "projecttitle7": "SIEM & IDS",
  "project7": "Architecture de supervision de sécurité basée sur Suricata et la stack ELK pour détecter et analyser des intrusions réseau en temps réel.",
  "titlerightE0": "Détection d'anomalies réseau",
  "textrightE0": "Dans le cadre d'un projet universitaire à l'UQAC, j'ai conçu et déployé une architecture complète de supervision de sécurité réseau. Le système repose sur Suricata en tant qu'IDS/IPS pour l'analyse du trafic, syslog-ng pour la centralisation des logs, Elasticsearch pour l'indexation et le stockage, et Kibana pour la visualisation. L'ensemble forme un SIEM fonctionnel capable de détecter des comportements malveillants en temps réel grâce à des dashboards personnalisés et des alertes automatisées via Slack.",
  "titlerightE1": "Scénarios d'attaque simulés",
  "textrightE1": "Pour valider l'efficacité du système, j'ai implémenté et testé 5 scénarios d'attaque : détection de paquets ICMP suspects, scan de ports avec Nmap, tentatives de connexion SSH par brute-force, fuzzing d'applications web, et tentatives d'accès FTP anonyme. Chaque scénario a été configuré avec des règles Suricata dédiées, et les alertes générées étaient visibles en temps réel dans Kibana. L'automatisation des notifications Slack permettait une réactivité immédiate face aux menaces détectées."
}
