{
  "home": "Home",
  "about": "About me",
  "projects": "Projects",
  "contact": "Contact",
  "resume": "CV",
  "btnresume": "Curriculum Vitæ",

  "homeMainTextBeg": "Hi there! I am a computer science ",
  "homeMainTextMid": "student ",
  "homeMainTextEnd": "at Polytech Lyon. At the moment, I am learning",

  "aboutTitle0": "A few words about myself",
  "aboutTitle1": "About me",
  "aboutText0": "It is a pleasure to meet you! I am Julien, a computer science engineering student based in Lyon.",
  "aboutText1": "My studies are helping me acquire the technical knowledge I will need to enter the professional world. I am really interested in software development and would love to know more about cybersecurity. I am learning a wide array of programming languages, which allows me to adapt to different tasks in my day-to-day projects",
  "aboutText2": "Starting in the 2025–2026 academic year, I will continue my studies at the Université du Québec à Chicoutimi (UQAC) as part of a double degree program. There, I will pursue a master’s degree in cybersecurity to deepen my skills in protecting systems and data.",

  "projectTitle0": "What I have coded",
  "projectTitle1": "Projects",
  "project0": "Creation of a personal portfolio website intended to showcase my skills and completed projects.",
  "project1": "A website featuring an e-commerce platform selling food with authentication capabilities for users.",
  "project2": "A website modeled after IMDB, focusing on movie databases and information.",
  "project3": "1D cellular automaton in Java and forest fire simulation with a graphical interface.",
  "project4": "Graphical Interface Implementation: Mastering Object-oriented programming through game development.",
  "project5": "Learning Modularity: Mastering project modularity using the Observer pattern.",
  "project6": "Solving the knapsack problem in Python using metaheuristic algorithms to optimize item selection.",
  "projecttitle0": "Portfolio",
  "projecttitle1": "The French Shop",
  "projecttitle2": "Tutored Project",
  "projecttitle3": "Cellular Automata",
  "projecttitle4": "Connect 4",
  "projecttitle5": "Sokoban",
  "projecttitle6": "Metaheuristics",

  "contactTitle0": "What's next?",
  "contactTitle1": "Let’s get in touch",
  "contactText": "If you have heard about an opportunity that suits what I am looking for, please let me know. Wether you have a question or just want to say « Hi », My inbox is always open.  I will get back to you as soon as possible!",

  "footer0": "Made while eating ",
  "footer1": "in Lyon",

  "buttonBack": "Back",
  "titleleft0": "Languages",
  "titleleft1": "Technologies",
  "titleleft2": "Contributors",
  "titleright0": "Portfolio Project",
  "titleright1": "Its purpose",
  "textright0": "My portfolio, crafted using React.js and SCSS, is a testament to my ongoing journey in mastering new technologies. It presents a selection of my projects in an interactive and aesthetically pleasing manner, demonstrating not only my current skills but also my commitment to learning and adopting cutting-edge web development practices. This platform is both a showcase of my work and an indication of my continuous growth in the tech field.",
  "textright1": "My project is a comprehensive portfolio website designed to showcase my work, skills, and professional background. It features a detailed presentation of my projects, an 'About Me' section that provides insights into my personal and professional journey, and a downloadable CV for a closer look at my credentials. Key functionalities include a night mode for comfortable viewing, bilingual translation in French and English to cater to a wider audience, and a contact section equipped with a mailto link for easy communication. The website is fully responsive, ensuring a seamless experience across various devices and screen sizes.",

  "titlerightB0": "The French Shop Project",
  "textrightB0": "My project is a foray into the world of e-commerce, specifically focusing on an online food store where users can browse and place orders. Developed with an emphasis on real-world e-commerce site functionalities, this platform is built using React.js and SCSS. It demonstrates not just my capability to create a user-friendly shopping experience but also my ongoing commitment to learning and applying new web development technologies. Through this project, I have gained practical experience in integrating essential e-commerce features, furthering my journey in the tech field while aiming to make online food shopping as intuitive and efficient as possible.",
  "textrightB1": "My project introduces an innovative e-commerce platform tailored for food shopping, which enhances the user experience by enabling account creation for personalized shopping. Users can log in to add products to their cart, proceed to checkout, and receive a generated invoice for their orders. Remarkably, the platform also accommodates guest users, allowing them to place orders without an account, ensuring flexibility and convenience for all users. Additionally, an exclusive admin login feature is integrated, not for placing orders, but for accessing a specialized dashboard that displays all placed orders. Here, admins have the capability to confirm orders, streamlining the management process. This project not only showcases my ability to develop complex web functionalities but also underscores my commitment to learning and implementing advanced web development practices, offering a glimpse into my growing expertise in creating comprehensive, user-centric online solutions.",

  "titlerightP0": "Tutored project",
  "textrightP0": "My IMDB-inspired project, developed using React.js and a comprehensive film database, demonstrates my journey in learning and applying dynamic web development techniques. It provides a responsive, user-friendly interface for exploring an extensive film library, showcasing my growing skills and enthusiasm for both web technology and the entertainment sector. This endeavor reflects my ongoing commitment to mastering new technologies in the field.",
  "textrightP1": "My project is an advanced film database platform, akin to IMDB, enriched with features like search functionality, auto-completion, and comprehensive film details. It enables users to effortlessly search for movies, offering real-time suggestions through auto-completion linked to the database. Upon selection, it provides a detailed overview, including summaries, trailers, and additional film-related information. Furthermore, it suggests related films based on your search, enhancing the discovery process. This tool combines my growing knowledge in web development with my interest in the entertainment industry, showcasing my ability to integrate complex functionalities for an engaging user experience. The project is fully responsive, making film exploration accessible on any device.",

  "titlerightA0": "Automata Project",
  "textrightA0": "To enhance my Java skills and understanding of graphical interfaces, I engaged in a collaborative project that involved developing a wildfire simulation and a 1D cellular automaton. This project allowed us to explore variable parameters in simulating wildfires and customize rules for the cellular automaton, providing a hands-on approach to learning Java's GUI capabilities and algorithm implementation. It was a valuable experience in applying Java to create meaningful, interactive simulations, showcasing our collective ability to tackle complex programming challenges.",
  "textrightA1": "In our project, we developed a menu offering a choice between two simulations: a 1D cellular automaton where users can select the rule and initial list to generate the corresponding automaton, and a wildfire simulation. For the wildfire simulation, an initial setup window allows users to configure all parameters, such as wind direction and the number of initial fires. This project was designed to deepen our understanding of Java and its graphical interfaces, providing a practical application of these concepts through interactive simulations that challenge and enhance our programming skills.",

  "titlerightC0": "Connect 4 Project",
  "textrightC0": "To enhance my understanding of Java graphical user interfaces, I developed a Connect Four game, guided by specialized documentation provided by my professor. This project allowed me to refine my skills in creating interactive interfaces, showcasing my dedication to learning and mastering Java's GUI capabilities. Through this endeavor, I demonstrated my commitment to advancing my technical skills and exploring new areas of software development.",
  "textrightC1": "In my journey to master graphical user interfaces, I developed a versatile menu within a GUI project, offering users the choice between Player vs. Player and Player vs. Computer game modes. This interactive menu not only facilitates seamless navigation between different gameplay options but also allows users to adjust the difficulty level, return to the main menu, and explore various settings, ensuring a tailored gaming experience. This project underscores my ability to create flexible and user-friendly interfaces, reflecting my dedication to enhancing my programming skills and providing engaging digital experiences.",

  "titlerightS0": "Sokoban Project",
  "textrightS0": "To deepen my understanding of modularity in Java, I developed a Sokoban game, guided by the advice of my professor. This project, undertaken at Polytech Lyon, allowed me to refine my skills in creating modular software, demonstrating my commitment to learning and mastering good software development practices. Through this project, I have illustrated my dedication to improving my technical skills and exploring new areas of software development.",
  "textrightS1": "The main objective was to structure the code in a modular way, allowing for easy maintenance and future enhancements. The game offers an intuitive graphical interface where players can navigate through different levels and reset games. This project demonstrates my ability to design robust and modular software, while also enhancing my skills in software engineering and object-oriented programming.",

  "titlerightM0": "The Knapsack Project",
  "textrightM0": "As part of my learning in optimization techniques, I carried out a Python project focused on solving the knapsack problem. The goal was to develop and compare several metaheuristic algorithms in order to find effective solutions to this classic combinatorial problem. I implemented methods such as Tabu Search, Genetic Algorithms, and Simulated Annealing. This project allowed me to deeply explore how these approaches work and perform on various datasets, while strengthening my skills in algorithm design and data structure handling with Python.",
  "textrightM1": "This project, carried out as part of a discrete optimization course, aimed to compare different metaheuristics applied to the knapsack problem. The objective was to analyze several methods by measuring their execution time, the quality of the solutions obtained, and the influence of various parameters. The results were organized into graphs and tables to assess the effectiveness of each approach and identify the most suitable methods depending on the situation."
}
